grodansparadis/vscp-din-wireless-esp32-can-z102/firmware/main/mqtt.c
  // Nothing to do if message is empty
  if (!strlen(msg)) {
    return VSCP_ERROR_SUCCESS;
  }

  // Only publish if log topic is configured
  if (strlen(g_persistent.mqttPubLog)) {

    char *newTopic = calloc(MQTT_SUBST_BUF_LEN, 1);
    if (NULL == newTopic) {
      ESP_LOGE(TAG, "Unable to allocate memory.");
      free(pbuf);
      return VSCP_ERROR_MEMORY;
    }

    // Expand log topic template (no event context)
    const char *pTopic = g_persistent.mqttPubLog;
    mqtt_topic_subst(newTopic, MQTT_SUBST_BUF_LEN, pTopic, NULL);

    // Publish log message with configured QoS and retain flag
    int msgid = esp_mqtt_client_publish(g_mqtt_client,
                                        newTopic,
                                        pbuf,
                                        strlen(pbuf),
                                        g_persistent.mqttQos,
                                        g_persistent.mqttRetain);
    if (-1 != msgid) {
      s_mqtt_statistics.nPubLog++;
    }
    else {
      s_mqtt_statistics.nPubLogFailures++;
      ESP_LOGE(TAG,
               "Failed to publish MQTT log message. id=%d Topic=%s outbox-size = %d",
               msgid,
               g_persistent.mqttPubLog,
               esp_mqtt_client_get_outbox_size(g_mqtt_client));
    }

    free(newTopic);
  }

  return VSCP_ERROR_SUCCESS;
}

// ============================================================================
//                          MQTT Event Handler
// ============================================================================

/**
 * @brief Event handler callback for MQTT client events
 *
 * This function is called by the ESP-IDF MQTT event loop for all MQTT-related
 * events including connection, disconnection, publish confirmation, incoming
 * data, subscriptions, and errors. It maintains connection state and statistics.
 *
 * Key functionality:
 * - Sets s_mqtt_connected flag on CONNECT/DISCONNECT
 * - Subscribes to configured topics on connection
 * - Updates statistics counters for all events
 * - Logs detailed error information for troubleshooting
 *
 * @param handler_args User data registered with the event (unused)
 * @param base         Event base identifier (ESP_EVENT_MQTT_BASE)
 * @param event_id     Specific MQTT event type (MQTT_EVENT_*)
 * @param event_data   Event data structure (esp_mqtt_event_handle_t)
 */
static void
mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
  ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%d", base, (int) event_id);
  esp_mqtt_event_handle_t event   = event_data;
  esp_mqtt_client_handle_t client = event->client;
  int msg_id;
  switch ((esp_mqtt_event_id_t) event_id) {

    case MQTT_EVENT_BEFORE_CONNECT:
      ESP_LOGI(TAG, "Preparing to connect");
      break;

    case MQTT_EVENT_CONNECTED:
      s_mqtt_connected = true;
      s_mqtt_statistics.nConnect++;
      ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");

      // Subscribe to configured topics (TODO: make this configurable)
      msg_id = esp_mqtt_client_subscribe(client,
                                         "vscp/FF:FF:FF:FF:FF:FF:FF:FE:B8:27:EB:CF:3A:15:00:01/10/6/1/0",
                                         0); // QoS 0
      ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_DISCONNECTED:
      s_mqtt_connected = false;
      s_mqtt_statistics.nDisconnect++;
      ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
      // esp_mqtt_client_reconnect(client);
      break;

    case MQTT_EVENT_SUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
      // Acknowledge successful subscription with status message
      // msg_id = esp_mqtt_client_publish(client, "esp-now/status", "Successful subscribe", 0, 0, 0);
      // ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
      break;

    case MQTT_EVENT_UNSUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_PUBLISHED:
      // Increment confirmation counter (for QoS > 0)
      s_mqtt_statistics.nPubConfirm++;
      ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_DATA:
      // Received message on subscribed topic
      ESP_LOGI(TAG, "MQTT_EVENT_DATA");
      printf("TOPIC=%.*s\r\n", event->topic_len, event->topic);
      printf("DATA=%.*s\r\n", event->data_len, event->data);
      fflush(stdout);
      // TODO: Parse incoming VSCP events and process them
      break;

    case MQTT_EVENT_ERROR:
      s_mqtt_statistics.nErrors++;
      ESP_LOGI(TAG, "MQTT_EVENT_ERROR");

      // Detailed error logging for troubleshooting
      if (event->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
        // TLS/TCP transport errors (including certificate validation failures)
        ESP_LOGI(TAG, "Last error code reported from esp-tls: 0x%x", event->error_handle->esp_tls_last_esp_err);
        ESP_LOGI(TAG, "Last tls stack error number: 0x%x", event->error_handle->esp_tls_stack_err);
        ESP_LOGI(TAG,
                 "Last captured errno : %d (%s)",
                 event->error_handle->esp_transport_sock_errno,
                 strerror(event->error_handle->esp_transport_sock_errno));
      }
      else if (event->error_handle->error_type == MQTT_ERROR_TYPE_CONNECTION_REFUSED) {
        // MQTT protocol-level connection refusal (bad credentials, etc.)
        ESP_LOGI(TAG, "Connection refused error: 0x%x", event->error_handle->connect_return_code);
      }
      else {
        ESP_LOGW(TAG, "Unknown error type: 0x%x", event->error_handle->error_type);
      }
      break;

    default:
      ESP_LOGI(TAG, "Other event id:%d", event->event_id);
      break;
  }
}

// ============================================================================
//                          MQTT Client Control
// ============================================================================

/**
 * @brief Initialize and start the MQTT client
 *
 * This function creates and starts the MQTT client using configuration from
 * g_persistent. It supports both plain MQTT and MQTT over TLS/SSL with
 * optional client certificate authentication.
 *
 * Configuration sources:
 * - Broker: g_persistent.mqttUrl and mqttPort
 * - Credentials: mqttUser, mqttPw
 * - Client ID: mqttClientId (supports {{node}} and {{guid}} templates)
 * - TLS: enableMqttTls, mqttCaCert, mqttClientCert, mqttClientKey
 *
 * TLS Features:
 * - Automatic scheme selection (mqtt:// vs mqtts://)
 * - Server certificate verification via CA certificate
 * - Optional mutual TLS with client certificate and private key
 * - Certificates stored in PEM format (up to 1024 bytes each)
 *
 * @note Client ID templates are expanded before connection
 * @note Session is persistent (clean_session = false)
 * @note Keepalive interval is 60 seconds
 */
void
mqtt_start(void)
{
  ESP_LOGI(TAG, "Starting MQTT client");

  // Get base MAC address (used for unique identification if needed)
  uint8_t mac[8];
  ESP_ERROR_CHECK(esp_base_mac_addr_get(mac));

  char clientid[128], save[128], workbuf[48];

  memset(clientid, 0, sizeof(clientid));
  strncpy(clientid, g_persistent.mqttClientId, sizeof(clientid) - 1);

  // Expand client ID template: {{node}} → node name
  vscp_fwhlp_strsubst(clientid, sizeof(clientid), g_persistent.mqttClientId, "{{node}}", g_persistent.nodeName);
  strcpy(save, clientid);

  // Expand client ID template: {{guid}} → GUID string
  vscp_fwhlp_writeGuidToString(workbuf, g_persistent.guid);
  vscp_fwhlp_strsubst(clientid, sizeof(clientid), save, "{{guid}}", workbuf);

